{
  "player": [
    { "strPlayer": "Robert Woods", 
      "strPosition": "WR", 
      "strNumber": "#2",
      "strHeight": "6-0",
      "strWeight": "195 lbs",
      "strAge": "30",
      "strThumb": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_6_desktop/f_auto/titans/lzd0srg1jbwyzoyivduo.jpg",
      "strExperience": "10 Years",
      "strCollege": "USC",
      "strBio": ""
    },
    { "strPlayer": "Caleb Farley", 
      "strPosition": "CB", 
      "strNumber": "#3",
      "strHeight": "6-2",
      "strWeight": "197 lbs",
      "strAge": "23",
      "strThumb": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_6_desktop/f_auto/titans/ncollfvhi784oohn6buv.jpg",
      "strExperience": "2 Years",
      "strCollege": "Virginia Tech",
      "strBio": "The Titans selected Caleb Farley with the 22nd overall pick in the first round of the 2021 NFL Draft. The 6-foot-2 inch, 197-pound defender possesses a rare combination of size and speed for an athlete at his position. The Maiden, N.C., native only began playing cornerback as a redshirt freshman at Virginia Tech after switching from wide receiver. He took to his new position quickly, intercepting six passes in 24 games with the Hokies."
    },
    { "strPlayer": "Ryan Stonehouse", 
      "strPosition": "P", 
      "strNumber": "#4",
      "strHeight": "5-10",
      "strWeight": "193 lbs",
      "strAge": "23",
      "strThumb": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_6_desktop/f_auto/titans/mdnauvbd17ochrojld74.jpg",
      "strExperience": "R",
      "strCollege": "Colorado State",
      "strBio": ""
    },
    { "strPlayer": "Logan Woodside", 
      "strPosition": "QB", 
      "strNumber": "#5",
      "strHeight": "6-1",
      "strWeight": "213 lbs",
      "strAge": "27",
      "strThumb": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_6_desktop/f_auto/titans/gd4jt6luf1bfzrwqnsze.jpg",
      "strExperience": "3 years",
      "strCollege": "Toledo",
      "strBio": "Quarterback Logan Woodside spent the first three weeks of the 2018 season with the Titans on the practice squad, and he re-signed with the club during the 2019 offseason following a stint with the Alliance of American Football League's San Antonio Commanders. The 6-foot-1 inch, 213-pounder was originally drafted by the Cincinnati Bengals in the seventh round (249th overall) of the 2018 NFL Draft. A native of Frankfort, Ky., he established program records at Toledo in passing yards (10,514), touchdowns (93), passing efficiency (162.87) and 300-yard games (17) during a four-year career. His 93 touchdown passes ranks fifth all-time in MAC history."
    },
    { "strPlayer": "Brett Kern", 
      "strPosition": "P", 
      "strNumber": "#6",
      "strHeight": "6-2",
      "strWeight": "214 lbs",
      "strAge": "36",
      "strThumb": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_6_desktop/f_auto/titans/mxisd3mdrfgodrrfymcf.jpg",
      "strExperience": "15 years",
      "strCollege": "Toledo",
      "strBio": "Since joining the Titans in 2009, Brett Kern has placed his name at the very top of most of the franchise's leaderboards at his position. He passed Craig Hentrich (861 punts) in 2020 as the organization's all-time leading punter and finished the season with 876 punts in a Titans uniform. He also concluded 2020 as the team's all-time career leader in gross punting average (45.9 yards), net punting average (40.8) and punts placed inside the 20 (355). Kern owns the top eight net punting seasons in franchise history and six of the team's top eight gross punting seasons. With 183 career games with the Titans through 2020, Kern ranked fourth in franchise history behind Bruce Matthews (296), Elvin Bethea (210) and Brad Hopkins (194). Kern's total is the most for any player during the franchise's \"Titans era\" (since 1999). When Kern was placed on injured reserve during the 2020 season, it ended his consecutive games played streak ended at 199 games, including his career with the Titans and Denver Broncos. His streak with the Titans ended at 177 consecutive games played, finishing as the second-longest streak in franchise history behind Bruce Matthews' 232 consecutive games from 1987 to 2001. Kern was named to three consecutive Pro Bowls from 2017 to 2019 and earned first team Associated Press All-Pro honors for the first time in 2019. Kern also has served as the team's holder on field goal and extra point attempts for his entire tenure. The University of Toledo product was acquired by the Titans during the 2009 season when he was claimed off waivers from the Denver Broncos."
    },
    { "strPlayer": "Malik Willis", 
      "strPosition": "QB", 
      "strNumber": "#7",
      "strHeight": "6-1",
      "strWeight": "219 lbs",
      "strAge": "23",
      "strThumb": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_6_desktop/f_auto/titans/yekrsdkxjjs4qd8defbb.jpg",
      "strExperience": "R",
      "strCollege": "Liberty",
      "strBio": ""
    }
  ]
}
